app/controllers/todos_controller.rb

	def index
		validateUIDCookie
		uid = cookies[:uid]
		@todo = Todo.new
		@todos = Todo.where(:uid => uid, :status => 0).order(created_at: :desc)
---
SELECT "todos".* FROM "todos" WHERE "todos"."uid" = ? AND "todos"."status" = ?  ORDER BY "todos"."created_at" DESC  [["uid", "7bf4187f2b4c59f714833af1"], ["status", 0]]

	def create
		uid = cookies[:uid]
		if(!uid)
			redirect_to root_path
		end
		text = params[:todo][:text]
		if(text.empty? == false)
			if (Todo.exists?(:uid => uid, :text => text))
				redirect_to root_path
			else
				status = 0
  				Todo.create(:uid => uid, :text => text, :status => status)
---
SELECT  1 AS one FROM "todos" WHERE "todos"."uid" = ? AND "todos"."text" = ? LIMIT 1  [["uid", "7bf4187f2b4c59f714833af1"], ["text", "test"]]
INSERT INTO "todos" ("uid", "text", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uid", "7bf4187f2b4c59f714833af1"], ["text", "text"], ["status", 0], ["created_at", "2015-07-09 07:39:25.954404"], ["updated_at", "2015-07-09 07:39:25.954404"]]

	def destroy
    	@todo = Todo.find(params[:id])
    	uid = cookies[:uid]
    	if(!uid)
			redirect_to root_path
		end
    	if(@todo.uid == uid)
    		@todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 5]]

  	def complete
  		@todo = Todo.find(params[:id])
    	uid = cookies[:uid]
    	if(!uid)
			redirect_to root_path
		end
    	if(@todo.uid == uid)
    		if(@todo.status == 0)
    			@todo.update_attribute('status', 1)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "todos" SET "status" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["status", 1], ["updated_at", "2015-07-09 08:31:51.738285"], ["id", 3]]